export default {
  "html_title": "Партнерка",
  "about": "О нас",
  "contests": "Конкурсы",
  "events": "Мероприятия",
  "html_head_title": "Глагне - HTML Meta Tag",
  "html_meta_description": "Новая главная страница",
  "title": "Глагне",
  "events_page.title": "Мероприятия",
  "events_page.subtitle": "Будем рады новым знакомствам и встречам с партнерами :)",
  "events_page.dogs_dialog": "-Тебе нравятся пёсики?\n -Пёсики? \n -Да, пёсики. \n-А, собаки. Да, пёсики мне нравятся.",
  "contests_page.title": "Страница конкурсов",
  "contests_page.africa": "Конкурс на африканское гео",
  "contests_page.india": "Конкурс на индийское гео",
  "africa_contest_page.title": "Страница африканского конкурса",
  "africa_contest_page.text": "Чёрные панте́ры — тёмноокрашенные особи из рода пантер, представляющих собой генетический вариант окраски — проявление меланизма. Чёрная пантера не является самостоятельным видом, это леопард (азиатский, африканский) или ягуар.",
  "india_contest_page.title": "Страница индийского конкурса",
  "india_contest_page.text": "Болливу́д (хинди बॉलीवुड, англ. Bollywood) — это синоним киноиндустрии индийского города Мумбаи (бывш. Бомбей), названной так по аналогии с Голливудом (Hollywood) в Калифорнии (США). Болливудом также официально называют хиндиязычный кинематограф. Однако помимо хинди в Мумбаи проходят съёмки кинолент на урду, панджаби и английском языках."
}
