<template>
  <Layout>
    <div class="compare-page">
      <h1>Сравнение фреймворков для глагне</h1>
      <p>Практическая возможность реализовать поставленную задачу - создавать мультиязычные отдельные лендосы и их
        связки с возможностью деплоить их в цдн. Без боли.</p>
      <p>Простота в разработке. По этой причине я ставлю жирный минус идее с питоном и го - я посмотрел доку хьюго и
        понял, что мне будет не комфортно работать с шаблонизатором, который базируется на незнакомом мне языке. А
        начинать изучение гошки/питона с шаблонизатора чот как-то так себе. Лизе будет еще больнее.</p>
      <p>Минимальный бойлерплейт при разработке. Он должен либо отсутствовать из коробки, либо один раз и несложно
        спрятаться под капотом и доставаться оттуда как можно реже.</p>
      <p>Понятная файловая структура. Должно быть понятно что откуда как работает.</p>
      <p>Максимальная изкоробочность в локализации. Роутинг, определение языков, возможность использовать локаль в
        логике.</p>
      <p>Отсутствие необходимости создавать отдельные файлы под конкретный язык, как в некоторых SSG бложикового
        типа.</p>
      <p>Изкоробочная или легкоплагинная функция translationString. Хороший пример - Yii::t($namespace, $key, $params,
        $locale). Юи, на самом деле, вообще хороший пример локализации в целом.</p>
      <p>Результат сборки должен быть приблизительно таким и хоститься на любой статике:</p>
      <pre>
    --locales
    &nbsp;&nbsp;&nbsp;&nbsp;--ru/some_message_files
    &nbsp;&nbsp;&nbsp;&nbsp;--en/some_message_files (default)
    --pages
    &nbsp;&nbsp;&nbsp;&nbsp;--index
    &nbsp;&nbsp;&nbsp;&nbsp;--second-page
    &nbsp;&nbsp;&nbsp;&nbsp;--third-page
    --components_and_other_assets_folders

    >>>>>>>>>>>>>>>>>>

    --index.html (english in root)
    --second-page.html
    --third-page.html
    --ru/
    &nbsp;&nbsp;&nbsp;&nbsp;--index.html
    &nbsp;&nbsp;&nbsp;&nbsp;--second-page.html
    &nbsp;&nbsp;&nbsp;&nbsp;--third-page.html
    --assets_folder/
  </pre>
      <p>Большинство SSG это сборщики бложиков/документации на маркдауне. Адекватной локализацией там даже не пахнет.
        Поэтому многие были отброшены на этапе беглого прочтения Getting started и забыты. Были отброшены го и питон. Я
        прочитал доку к хьюго и понял, что мне будет очень неприятно врубаться еще и в язык. Посоветовался с Лизой, она
        тоже считает, что новые языки это в данной ситуации плохо. Да и сам хьюго не подходил под требования. Питон
        поэтому я даже не стал смотреть.</p>
      <p>Из того, что было отсмотрено:</p>
      <table>
        <thead>
        <tr>
          <th></th>
          <th>
            <h3>Nuxt.js</h3>
            <a href="https://github.com/jimstacey-spb/nuxt-demo/tree/master">GitHub</a><br/><br/>
            <a href="https://jimstacey-spb.github.io/nuxt-demo/contests/">GitHub Pages</a><br/><br/>
          </th>
          <th>
            <h3>Gatsby.js</h3>
            <a href="https://github.com/jimstacey-spb/gatsby-demo">GitHub</a><br/><br/>
            <a href="https://jimstacey-spb.github.io/gatsby-demo/">GitHub Pages</a><br/><br/>
          </th>
          <th>
            <h3>JigSaw</h3>
          </th>
        </tr>
        </thead>
        <tbody>
        <tr>
          <td>Плюсы</td>
          <td>
            1) Завелось из коробки и без боли<br/>
            2) Достойная дока, в том числе по локализации<br/>
            3) Изначальный прототип на гэтсби безболезненно переехал сюда<br/>
            4) Vue, с ним многие знакомы из команды
          </td>
          <td>
            1) Работает. Поставленная задача выполнена, в целом, без особой боли.
          </td>
          <td>
            1) Пыха, ларка, блейд
          </td>
        </tr>
        <tr>
          <td>Минусы</td>
          <td>
            1) В целом, наверное, не обнаружил.<br/>
            2) Vue мне будет сложнее освоить, чем реакт.
          </td>
          <td>
            1) Графкуэль, он бесит и не нужен.<br/>
            2) Пришлось немного побутстрапить локализацию, покопаться в комментах на гитхабе и почитать статьи, но, в
            целом, норм.<br/>
            3) Реакт, хотя я его за минус не считаю.
          </td>
          <td>
            1) Выполнить задачу не получилось, даже с болью<br/>
            2) Очень скудная дока про локализацию
          </td>
        </tr>
        </tbody>
      </table>
      <p>Вне обзора остался Next.js, но как я понимаю, он от Nuxt отличается только реактом вместо Vue.</p>
      <p>Подытоживая, предлагаю выбрать Nuxt, т.к. он собрал больше всего плюсиков.</p>
    </div>
  </Layout>
</template>

<script>
export default {
  name: "compare"
}
</script>

<style lang="scss">

</style>
